ninety_nine_cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "White"], ["name", "Bobby"], ["sex", "F"], ["updated_at", "2022-03-11 21:56:11.753605"], ["id", 1]]